Catalogs/СервисПровайдерыСУЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СервисПровайдерыСУЗ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСервисПровайдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСервисПровайдеровСУЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьВидыПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПродукции</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварныеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТоварнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СервисПровайдерыСУЗ/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	УстановитьПредставлениеТоварныхГрупп(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ТоварныеГруппы.Количество() = 0 Тогда
		ТекстСообщения = Нстр("ru = 'Не введено ни одной строки в список ""Товарные группы""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ТоварныеГруппыПредставление",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидСервисПровайдераПриИзменении(Элемент)
	
	УстановитьСтранаТолькоРоссия(ЭтотОбъект);
	
	Россия = ПредопределенноеЗначение("Справочник.СтраныМира.Россия");
	
	Если СтранаТолькоРоссия И Объект.Страна <> Россия Тогда
		Объект.Страна = Россия;
	КонецЕсли;
	
	ОбновитьВидимостьДоступностьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеГруппыПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормаМножественногоВыбораИСМП",
		ПараметрыФормыВыбораВидовПродукции(),
		ЭтотОбъект, , , ,
		Новый ОписаниеОповещения("ТоварныеГруппыЗавершениеВыбора", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПараметрыФормыВыбораВидовПродукции()
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Заголовок",         "");
	ПараметрыОткрытия.Вставить("ДоступныеЗначения", Новый СписокЗначений);
	ПараметрыОткрытия.Вставить("ВыбранныеЗначения", Новый СписокЗначений);
	
	Для Каждого Строка Из Объект.ТоварныеГруппы Цикл
		ПараметрыОткрытия.ВыбранныеЗначения.Добавить(Строка.ТоварнаяГруппа);
	КонецЦикла;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПараметрыОткрытия.Заголовок = НСтр("ru = 'Сервис-провайдер СУЗ (создание) (товарные группы)'");
	Иначе
		ПараметрыОткрытия.Заголовок = СтрШаблон(
			НСтр("ru = '%1 (Сервис-провайдер СУЗ) (товарные группы)'"),
			Объект.Наименование);
	КонецЕсли;
	
	ПараметрыОткрытия.ДоступныеЗначения.ЗагрузитьЗначения(
		ЗаказНаЭмиссиюСУЗКлиентСервер.ТоварныеГруппыДоступныеДляСервисПровайдера());
	
	Возврат ПараметрыОткрытия;
	
КонецФункции

#Область ПриИзмененииРеквизитов

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеТоварныхГрупп(Форма)
	
	Объект = Форма.Объект;
	
	Форма.КоличествоТоварныхГрупп = Объект.ТоварныеГруппы.Количество();
	
	Если Форма.КоличествоТоварныхГрупп = 0 Тогда
		Форма.ТоварныеГруппыПредставление = НСтр("ru = 'Выбрать'");
		Возврат ;
	КонецЕсли;
	
	Представление = "";
	ПредставлениеДлина = 0;
	МаксимальнаяДлина = 60;
	КоличествоДобавлено = 0;
	
	Разделитель = ", ";
	ТекстОкончанияСтроки = НСтр("ru = ' ( + еще %1 )'");
	
	Для Каждого Строка Из Объект.ТоварныеГруппы Цикл
		
		ТекущееПредставление = Строка(Строка.ТоварнаяГруппа);
		Если КоличествоДобавлено > 0 Тогда
			ТекущееПредставление = Разделитель + ТекущееПредставление;
		КонецЕсли;
			
		ПредставлениеДлина = ПредставлениеДлина + СтрДлина(ТекущееПредставление);
		
		Если Форма.КоличествоТоварныхГрупп = КоличествоДобавлено + 1 Тогда
			МаксимальнаяДлина = МаксимальнаяДлина + СтрДлина(ТекстОкончанияСтроки);
		КонецЕсли;
		
		Если ПредставлениеДлина > МаксимальнаяДлина И КоличествоДобавлено > 0 Тогда
			Представление = Представление + СтрШаблон(ТекстОкончанияСтроки, Форма.КоличествоТоварныхГрупп - КоличествоДобавлено);
			Прервать;
		КонецЕсли;
		
		Представление = Представление + ТекущееПредставление;
		
		КоличествоДобавлено = КоличествоДобавлено + 1;
		
	КонецЦикла;
	
	Форма.ТоварныеГруппыПредставление = Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварныеГруппыЗавершениеВыбора(Результат, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТоварныеГруппы.Очистить();
	
	Для Каждого ЭлементСписка Из Результат Цикл
		Строка = Объект.ТоварныеГруппы.Добавить();
		Строка.ТоварнаяГруппа = ЭлементСписка.Значение;
	КонецЦикла;
	
	Модифицированность = Истина;
	
	УстановитьПредставлениеТоварныхГрупп(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварныеГруппыПредставление.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("КоличествоТоварныхГрупп");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаТребуетВниманияГосИС);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	УправлениеПараметрамиВыбораРеквизитовФормы();
	
	УстановитьСтранаТолькоРоссия(ЭтотОбъект);
	
	ОбновитьВидимостьДоступностьЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеПараметрамиВыбораРеквизитовФормы()
	
	Массив = Новый Массив;
	
	Массив.Добавить(Новый ПараметрВыбора("Отбор.УчастникЕАЭС", Истина));
	Элементы.Страна.ПараметрыВыбора = Новый ФиксированныйМассив(Массив);
	
КонецПроцедуры	

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьДоступностьЭлементовФормы(Форма)
	
	Форма.Элементы.Страна.Доступность = Не Форма.СтранаТолькоРоссия;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСтранаТолькоРоссия(Форма)
	
	Форма.СтранаТолькоРоссия = Форма.Объект.ВидСервисПровайдера = ПредопределенноеЗначение("Перечисление.ВидыСервисПровайдеровСУЗ.ЦЭМ")
		Или Форма.Объект.ВидСервисПровайдера = ПредопределенноеЗначение("Перечисление.ВидыСервисПровайдеровСУЗ.КомиссионнаяПлощадка");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
